// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

// void MiddleNumber()
// {
//     int num = new Random().Next(100, 1000);
//     Console.WriteLine("Случайно выбранное число -" + num);
//     int dec = num / 10;
//     int result = dec % 10;
//     Console.WriteLine("Вторая цифра этого числа - " + result);
// }

// MiddleNumber();

